#+TITLE:Day 2: Dive!

https://adventofcode.com/2021/day/2

*** C++

#+begin_src C++ :includes '(<vector> <numeric> <iostream> <map>) :namespaces std :flags -std=c++11 :results verbatim
  #include <iostream>
  #include <fstream>
  using namespace std;

  int computePosition (const string& filename) {
      int horizontalPosition = 0;
      int depth = 0;

      ifstream file(filename);
      string direction;
      int value;

      while (file >> direction >> value) {
          if (direction == "forward")
              horizontalPosition += value;
          else if (direction == "down")
              depth += value;
          else if (direction == "up")
              depth -= value;
      }

      return horizontalPosition * depth;
  }

  int main() {
      cout << increaseCount("input.txt") << "\n";
  }
#+end_src

#+RESULTS:
: 1882980


*** C++

#+begin_src C++ :includes '(<vector> <numeric> <iostream> <map>) :namespaces std :flags -std=c++11 :results verbatim
  #include <iostream>
  #include <fstream>
  using namespace std;

  int computePosition (const string& filename) {
      int horizontalPosition = 0;
      int depth = 0;
      int aim = 0;

      ifstream file(filename);
      string direction;
      int value;

      while (file >> direction >> value) {
          if (direction == "forward") {
              horizontalPosition += value;
              depth += aim * value;
          }
          else if (direction == "down")
              aim += value;
          else if (direction == "up")
              aim -= value;
      }

      return horizontalPosition * depth;
  }

  int main() {
      cout << computePosition("input.txt") << "\n";
  }
#+end_src

#+RESULTS:
: 1971232560


